OpenFOAM-v1712/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/filmRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/wallFilmRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

divSchemes
{
    default none;
    div(phi,Uf) Gauss upwind;
    div(phid,deltaf) Gauss upwind;
    div(phi,hf) Gauss upwind;
}

gradSchemes
{
    default Gauss linear;
}

laplacianSchemes
{
    default Gauss linear uncorrected;
}

snGradSchemes
{
    default uncorrected;
}


// ************************************************************************* //
